{
    "resume_title": "Data Scientist | MLE | Programmer",
    "name": "Goh Yee Chern",
    "job_desc": "Data Scientist | MLE | Programmer",
    "email": "chern1990@gmail.com",
    "mobile": "+65-90117773 / +60-122771116",
    "linkedin": "https://www.linkedin.com/in/yee-chern-goh",
    "github": "https://github.com/chern1990",
    "website": "http://yeechern.ddns.net",
    "summary": [
        "<p>Results-driven <strong>Machine Learning Engineer and Data Scientist</strong> with <strong>extensive experience in AI, ML, and data analytics.</strong></p>",
        "<p>Skilled in <strong>building scalable ML models, developing LLM-based solutions, and deploying AI-driven risk mitigation strategies.</strong></p>",
        "<p>Proven ability to <strong>optimize fraud detection, behavioral analytics, and real-time AI solutions</strong> for large-scale platforms.</p>",
        "<p>Adept at <strong>Python, PyTorch, TensorFlow, SQL, AWS, and big data processing.</strong></p>"
    ],
    "work_exp": [
        [
            "Lead Machine Learning Engineer",
            "Bytedance (Singapore)",
            "Apr 2024 - Present",
            "As a lead MLE in Bytedance business risk control team, I am responsible safeguard the community health of Tiktok Local Services surface, minimize the damage of inauthentic behaviours by deploying sophisicated and state of the art risk controls.",
            {
                "title": "Key Achievements",
                "points": [
                    "Spearhead AI-driven content risk control for TikTok LocalService, implementing cutting-edge LLM and GraphSage models.",
                    "Developed spam perception algorithms (Leiden clustering, content classification) to detect fraudulent content.",
                    "Built real-time behavioral sequence models, reducing fraud/spam activities by 90%+",
                    "Fine-tuned LLM models for sentiment analysis, relevance prediction, and automated review rewriting.",
                    "Collaborated with cross-functional teams (XFN) to design anti-fraud policies and risk mitigation strategies.",
                    "Mentored junior/senior data scientists, fostering AI innovation and knowledge sharing."
                ]
            }
        ],
        [
            "Senior Data Scientist",
            "Bytedance (Singapore)",
            "Nov 2021 - Apr 2023",
            "As a data scientist in Bytedance business risk control team, I am responsible to develop rules, algorithm or ML models to minimize the damage of inauthentic behaviours on Bytedance platforms.",
            {
                "title": "Key Achievements",
                "points": [
                    "Developed and deployed high-precision fraud detection ML models, reducing risk in the TikTok Live ecosystem by 70%+.",
                    "Designed real-time fraud detection pipelines to monitor and flag suspicious activity with >90% accuracy.",
                    "Automated behavioral sequence modeling using deep learning (LSTM, Transformers) to detect scam patterns.",
                    "Partnered with Trust & Safety teams to prevent fraudulent activities across TikTok’s global ecosystem.",
                    "Trained and mentored new hires in advanced ML techniques and AI deployment."
                ]
            }
        ],
        [
            "Data Science Strategist",
            "Facebook (Singapore)",
            "Nov 2019 - Jun 2021",
            "As a data scientist at Facebook Connectivity, my main responsibilities is to leverage various data sources to provide actionable insights for mobile partners and bring more people to a faster internet.",
            {
                "title": "Key Achievements",
                "points": [
                    "Led APAC network planning initiatives, optimizing mobile tower placement and/or fiber routing using state of the art AI/ML solution.",
                    "Built automated data pipelines to generate network performance reports for global telecom partners.",
                    "Developed ML-based predictive models for infrastructure expansion and network optimization."
                ]
            }
        ],
        [
            "Data Scientist",
            "AIA (Malaysia)",
            "Oct 2018 - Oct 2019",
            "Responsible in performing advance data mining, statistical analysis and building various machine learning models that are able to solve various business problems across divisions.",
            {
                "title": "Key Achievements",
                "points": [
                    "Productionized fully automated ML models for repurchase propensity model and lead recommendation model.",
                    "Applied NLP and text mining to analyze call center data, extracting key insights for business decisions.",
                    "Automated geocoding and location-based analytics to improve agent allocation efficiency.",
                    "Mentor and assist junior data scientist in various innovation projects."
                ]
            }
        ],
        [
            "Network Data Analyst",
            "Digi Telecommunications (Malaysia)",
            "Sep 2016 - Sep 2018",
            "Responsible in detail network centralised analysis and optimisation to provide best quality of experience to mobile subscribers.",
            {
                "title": "Key Achivements",
                "points": [
                    "Built churn and NPS prediction models to maximize ROI on network investments.",
                    "Developed network congestion forecasting models, improving customer experience by 20%."
                ]
            }
        ],
        [
            "Regional RF Engineer",
            "Maxis (Malaysia)",
            "Apr 2014 - Sep 2016",
            "Responsible in radio planning and optimization to improve all GSM technologies (2G/3G/LTE) in assigned region.",
            {
                "title": "Key Achievements",
                "points": [
                    "Used geospatial analytics to reduce customer complaints by 25% through network optimization.",
                    "Deployed mobile coverage solutions for major events like Formula 1 and Moto GP."
                ]
            }
        ]
    ],
    "ds_projects": {
        "TikTok - Order Reviews Relevancy and Sentiment Analysis": [
            "Fine-tuned LLMs for sentiment classification and content relevance scoring to improve review analysis."
        ],
        "TikTok - Video POI Relevancy Prediction": [
            "Develop video content relevancy model to detect violate videos."
        ],
        "TikTok - User Behavioural Sequence Model": [
            "Developed LSTM/Transformer models to detect suspicious activity in TikTok Live, achieving 90%+ fraud prevention accuracy."
        ],
        "TikTok - Spam Classifaction Model": [
            "Built XGBoost models to classify spam chats, enforcing real-time moderation."
        ],
        "Marketing - Upsell Campaign Takeup Prediction Model": [
            "Created gradient-boosted models (GBDT) for campaign targeting, optimizing user engagement."
        ],
        "Telco - Customer Churn Prediction Model": [
            "Developed churn propensity models leveraging user behavior and network data."
        ],
        "Call Center/Email - NLP : Topic Modeling, Sentiment Analysis": [
            "Applied BERT models for sentiment analysis, topic modeling, and automated summarization of support cases."
        ]
    },
    "education_list": [
        [
            "Bachelor of Engineering in Electronics & Comm. System",
            "Australian National University",
            "2011 - 2012"
        ]
    ],
    "skill_list": {
        "Data Science & Analytics": [
            [
                "Python/R/ORE/SQL/Hive",
                "95"
            ],
            [
                "Advanced Data Analytics",
                "95"
            ],
            [
                "Machine Learning",
                "95"
            ],
            [
                "Pyspark/MLib",
                "95"
            ],
            [
                "Deep Learning (Tensorflow/Pytorch)",
                "95"
            ],
            [
                "NLP/LLM/Transformers",
                "95"
            ],	     [
                "Knowledge Graph",
                "95"
            ],
            [
                "Kafka",
                "95"
            ],
            [
                "Geospatial Analytics",
                "95"
            ],
            [
                "Tableau/Qlik",
                "95"
            ],
            [
                "RPA",
                "95"
            ],
            [
                "Git/Version Control",
                "95"
            ],            [
                "Project Management",
                "90"
            ],
            [
                "AWS/GCP/Oracle Cloud/Heroku",
                "90"
            ],
            [
                "Recommender System",
                "88"
            ]
        ]
    },
    "language_list": [
        [
            "English",
            "Fluent"
        ],
        [
            "Mandarin",
            "Native"
        ]
    ],
    "interest_list": [
        "Data Analytics",
        "Data Science",
        "Automation",
        "Robotics",
        "Artificial Intelligence",
        "Open Source Development"
    ],
    "_comment_work_exp": [
        [
            "Lead Data Scientist",
            "DBS (Singapore)",
            "Apr 2023 - Apr 2024",
            "",
            {
                "title": "Key Achievements",
                "points": [
                    "Lead the AIOps iniviative for Infrastructure SRE team, responsible to scope for AI/ML projects, develop and deliver project to mainframe SME team",
                    "Developed anomaly detection and root cause analysis tool for CICS mainframe SME team. Enables AI assisted investigation during incident or post-mortem analysis.",
			        "Developed mainframe batch job completion time prediction tool. Leverages knowledge graph to detect dependancy path, critical path and predict new batch completion time. Allows early detection of delay in batch jobs that can cause delay in daily branch operations."
                ]
            }
        ]
    ]
}
